
Процедура УстановитьКонтрагентЮралс(Контрагент=Неопределено) Экспорт
	
	Если Контрагент = Неопределено Тогда
		
		Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		
		// Юралс Кэпитал филиал ЮГРА, ИНН 7730675129, ОКПО 34455462
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ИНН = ""7730675129""
		|	И НЕ Контрагенты.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ИНН = ""7730675129""
		|	И Контрагенты.КодПоОКПО = ""34455462""
		|	И НЕ Контрагенты.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.КодПоОКПО = ""34455462""
		|	И НЕ Контрагенты.ПометкаУдаления"
		);
		
		Результат = Запрос.ВыполнитьПакет();
		
		Для й=1 По Результат.Количество() Цикл
			
			Выборка = Результат[й-1].Выбрать();
			Если Выборка.Количество() = 1 Тогда
				Если Выборка.Следующий() Тогда
					Контрагент = Выборка.Ссылка;
				КонецЕсли;
			КонецЕсли;
			
			Если Не Контрагент.Пустая() Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Константы.КонтрагентЮралс.Установить(Контрагент);
	
КонецПроцедуры