
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Ключ") И Параметры.Ключ.Пустая() Тогда
		
		Если Параметры.ЗначениеКопирования.Пустая() Тогда
			
			АдресПоставки = ПолучитьАдресПоставки(Объект, Элементы.АдресПоставки.СписокВыбора); //.ЗагрузитьЗначения(ПолучитьАдресПоставки(Объект, Ложь).ВыгрузитьЗначения());
			
			Если ПустаяСтрока(Объект.АдресПоставки) И Элементы.АдресПоставки.СписокВыбора.Количество()>0 Тогда
				Объект.АдресПоставки = Элементы.АдресПоставки.СписокВыбора[0].Значение;
			КонецЕсли;

		КонецЕсли;
		
	Иначе
		ТолькоПросмотр = Объект.Проведен;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ВспомогательныеФункции

&НаСервереБезКонтекста
Функция НайтиНоменклатуруПоКоду(КодПоиска)
	
	Возврат Справочники.Номенклатура.НайтиПоКоду(КодПоиска);
	
КонецФункции

#КонецОбласти // ВспомогательныеФункции

#Область КопированиеВставкаСтрокЧерезБуферОбмена

&НаСервере
Процедура СкопироватьСтрокиНаСервере(ИмяТаблицы="Товары")
	
	ОбщегоНазначения.СкопироватьСтрокиВБуферОбмена(Объект[ИмяТаблицы], 
		Элементы[ИмяТаблицы].ВыделенныеСтроки, Объект.Ссылка.Метаданные().Имя);

КонецПроцедуры

&НаСервере
Функция ВставитьСтрокиНаСервере(ИмяТаблицы="Товары")
	
	ПараметрыВставки = ОбработкаТабличныхЧастей.ПолучитьПараметрыВставкиДанныхИзБуфераОбмена(Объект.Ссылка, ИмяТаблицы);
	ОпределитьСписокСвойствДляВставкиИзБуфера(ПараметрыВставки);
	ОбработкаВыбораПодборВставкаИзБуфераНаСервере(ПараметрыВставки, ПараметрыВставки.ИмяТаблицы);
	
	Возврат ПараметрыВставки.КоличествоДобавленныхСтрок;
	
КонецФункции

&НаСервере
Процедура ОпределитьСписокСвойствДляВставкиИзБуфера(ПараметрыВставки)

	СписокСвойств = Новый Массив;
	СписокСвойств.Добавить("Номенклатура");
	СписокСвойств.Добавить("ЕдиницаИзмерения");
	СписокСвойств.Добавить("Количество");
	СписокСвойств.Добавить("Цена");
	
	ПараметрыВставки.СписокСвойств = ОбработкаТабличныхЧастей.ПолучитьСписокСвойствИмеющихсяВТаблицеДанных(
		ПараметрыВставки.Данные, СписокСвойств);
	
КонецПроцедуры
	
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКомандыВставки(Форма, Доступность)

	Доступность = Не Форма.ТолькоПросмотр И Доступность;
	Элементы = Форма.Элементы;
	Элементы.ТоварыВставитьСтроки.Доступность					 = Доступность;
	Элементы.ТоварыКонтекстноеМенюВставитьСтроки.Доступность	 = Доступность;

КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСтроки(Команда)
	
	КоличествоСтрок = Элементы.Товары.ВыделенныеСтроки.Количество();
	Если КоличествоСтрок = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СкопироватьСтрокиНаСервере();
	ОбработкаТабличныхЧастейКлиент.ОповеститьОКопированииСтрокВБуферОбмена(ЭтотОбъект, КоличествоСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьСтроки(Команда)
	
	КоличествоСтрок = ВставитьСтрокиНаСервере();
	ОбработкаТабличныхЧастейКлиент.ОповеститьОВставкеСтрокИзБуфераОбмена(ЭтотОбъект, КоличествоСтрок);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораПодборВставкаИзБуфераНаСервере(ВыбранноеЗначение, ИмяТаблицы)

	//ПараметрыОбъекта = Неопределено;
	//ЗаполнитьПараметрыОбъектаДляЗаполненияДобавленныхКолонок(ЭтотОбъект, ПараметрыОбъекта);

	//ДобавленныеСтроки = РеализацияТоваровУслугФормы.ОбработкаВыбораПодборВставкаИзБуфера(ЭтотОбъект, ВыбранноеЗначение, ИмяТаблицы);
	//
	//СписокСчетов = Новый Массив;
	//Для Каждого СтрокаТаблицы Из ДобавленныеСтроки.Товары Цикл
	//	Если ЗначениеЗаполнено(СтрокаТаблицы.СчетНаОплатуПокупателю) Тогда
	//		СписокСчетов.Добавить(СтрокаТаблицы.СчетНаОплатуПокупателю);
	//	КонецЕсли; 
	//КонецЦикла;
	//
	//РеквизитыСчетовНаОплату = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(СписокСчетов, "Номер, Дата");
	//
	//Для Каждого СтрокаТаблицы Из ДобавленныеСтроки.Товары Цикл
	//	ЗаполнитьДобавленныеКолонкиСтрокиТаблицыТовары(ЭтотОбъект, СтрокаТаблицы, РеквизитыСчетовНаОплату, ПараметрыОбъекта);
	//КонецЦикла;
	//
	//ЗаполнитьПризнакМаркируемойПродукцииТаблицыТовары(ДобавленныеСтроки.Товары, ИспользоватьКонтрольныеЗнакиГИСМ, ВестиУчетМаркируемойПродукцииИСМП);
	//
	//РеализацияТоваровУслугФормыКлиентСервер.ЗаполнитьРеквизитыСчетНаОплату(ЭтотОбъект);
	//
	//РеализацияТоваровУслугФормы.ПриДобавленииСчетов(ЭтотОбъект, СписокСчетов);
	//
	//ОбновитьИтоги(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти // КопированиеВставкаСтрокЧерезБуферОбмена

#Область АдресПоставки

&НаСервереБезКонтекста
Функция ПолучитьАдресПоставки(Параметры, Список=Неопределено)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 5
	|	Заявка.АдресПоставки,
	|	Заявка.АдресПоставки КАК Представление,
	|	СУММА(1) КАК Приоритет,
	|	1 КАК Порядок
	|ИЗ
	|	Документ.Заявка КАК Заявка
	|ГДЕ
	|	Заявка.Организация = &Организация
	|	И Заявка.Ссылка <> &Ссылка
	|	И Заявка.АдресПоставки <> """"
	|	И Заявка.Ответственный = &Ответственный
	|
	|СГРУППИРОВАТЬ ПО
	|	Заявка.АдресПоставки,
	|	Заявка.АдресПоставки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&АдресПоставки,
	|	""────────────────────────────────────────"",
	|	0,
	|	2
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 5
	|	Заявка.АдресПоставки,
	|	Заявка.АдресПоставки,
	|	СУММА(1),
	|	3
	|ИЗ
	|	Документ.Заявка КАК Заявка
	|ГДЕ
	|	Заявка.Организация = &Организация
	|	И Заявка.Ссылка <> &Ссылка
	|	И Заявка.АдресПоставки <> """"
	|	И Заявка.Ответственный <> &Ответственный
	|
	|СГРУППИРОВАТЬ ПО
	|	Заявка.АдресПоставки,
	|	Заявка.АдресПоставки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	Приоритет УБЫВ"
	);
	
	Запрос.УстановитьПараметр("Ссылка", Параметры.Ссылка);
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	Запрос.УстановитьПараметр("Ответственный", Параметры.Ответственный);
	Запрос.УстановитьПараметр("АдресПоставки", Параметры.АдресПоставки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Список = Неопределено Тогда
			Если Выборка.Приоритет = 2 Тогда
				Выборка.Следующий();
			КонецЕсли;
			Возврат Выборка.АдресПоставки;
		Иначе
			Список.Добавить(Выборка.АдресПоставки, Выборка.Представление);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ?(Список.Количество()>0, Список[0], "");
	
КонецФункции

&НаКлиенте
Процедура АдресПереходНаКартуНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	УправлениеКонтактнойИнформациейКлиентБП.ПоказатьНаКартеНажатие(ЭтотОбъект, Элемент, Объект.АдресПоставки);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресПоставкиНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтруктураПараметров = Новый Структура("Ссылка, Организация, Ответственный, АдресПоставки", Объект.Ссылка, Объект.Организация, Объект.Ответственный, Объект.АдресПоставки);
	
	Элемент.СписокВыбора = ПолучитьАдресПоставки(СтруктураПараметров, Ложь);
	
КонецПроцедуры

#КонецОбласти // АдресПоставки

&НаКлиенте
Процедура СрокПоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НачалоДня(ВыбранноеЗначение) < НачалоДня(Объект.Дата) Тогда
		ВыбранноеЗначение = НачалоДня(Объект.Дата);
	КонецЕсли;
	
КонецПроцедуры

#Область ВспомогательныеПоискаПоКаталожномуНомеру

// Функция проверяет наличие в строке цифр
//
// Параметры
//  СтрокаПроверки - Строка для проверки наличия цифр
// Возвращаемое значение:
//   Булево
//
Функция ВСтрокеЕстьЦифры(Знач СтрокаПроверки)
	
	Для й = 1 По СтрДлина(СтрокаПроверки) Цикл
		КодСимвола = КодСимвола(Сред(СтрокаПроверки, й, 1));
		Если (48 <= КодСимвола И КодСимвола <= 57) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции // ВСтрокеЕстьЦифры

Функция ПолучитьКаталожныйНомер(Номенклатура, Списком=Ложь)
	
	Если Списком Тогда
		Список = Новый СписокЗначений;
	ИначеЕсли Номенклатура.СтатьяЗатрат.Код <> "2.4.1" Тогда
		Возврат "";
	КонецЕсли;
	
	Если Не ПустаяСтрока(Номенклатура.Артикул) Тогда
		Если Списком Тогда
			Список.Добавить(Номенклатура.Артикул);
		Иначе
			Возврат СокрЛП(Номенклатура.Артикул);
		КонецЕсли;
	КонецЕсли;
	
	ЧастиСтроки = СтрЗаменить(СокрЛП(Номенклатура.Наименование), " ", Символы.ПС);
	
	Для й=-СтрЧислоСтрок(ЧастиСтроки) По -1 Цикл
		
		Строка = СтрПолучитьСтроку(ЧастиСтроки, -й);
		Если ВСтрокеЕстьЦифры(Строка) Тогда
			Если Списком Тогда
				Список.Добавить(Строка);
			Иначе
				Возврат Строка;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

Функция НайтиНоменклатуруПоСтроке(Знач СтрокаПоиска)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Номенклатура.Наименование,
	|	Номенклатура.Ссылка,
	|	Номенклатура.Код,
	|	Номенклатура.Артикул,
	|	Номенклатура.Наименование ПОДОБНО &СтрокаПоиска КАК НайденоПоНаименованию,
	|	Номенклатура.Артикул ПОДОБНО &СтрокаПоиска КАК НайденоПоАртикулу,
	|	Номенклатура.Код ПОДОБНО &СтрокаПоиска КАК НайденоПоКоду,
	|	ВЫБОР
	|		КОГДА Номенклатура.Код ПОДОБНО &СтрокаПоиска
	|			ТОГДА Номенклатура.Код
	|		КОГДА Номенклатура.Артикул ПОДОБНО &СтрокаПоиска
	|			ТОГДА Номенклатура.Артикул
	|		КОГДА Номенклатура.Наименование ПОДОБНО &СтрокаПоиска
	|			ТОГДА Номенклатура.Наименование
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ТекстСовпадения,
	|	Номенклатура.ЭтоЮралс
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ПометкаУдаления
	|	И (Номенклатура.Наименование ПОДОБНО &СтрокаПоиска
	|			ИЛИ Номенклатура.Артикул ПОДОБНО &СтрокаПоиска
	|			ИЛИ Номенклатура.Код ПОДОБНО &СтрокаПоиска)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура.ЭтоЮралс УБЫВ"
	);
	
	Запрос.УстановитьПараметр("СтрокаПоиска", "%"+СтрЗаменить(СтрокаПоиска," ", "%")+"%");
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции

Функция ПолучитьПредполагаемыйКаталожныйНомер(Номенклатура, Знач Текст)
	
	Список = Новый Массив;
	Номера = ПолучитьКаталожныйНомер(Номенклатура, Истина);
	
	Строки = СтрЗаменить(СокрЛП(Текст), " ", Символы.ПС);
	Для й=1 По СтрЧислоСтрок(Строки) Цикл
		
		СтрокаПоиска = СтрПолучитьСтроку(Строки, й);
		
		Для Каждого Элемент Из Номера Цикл
			Если Найти(ВРЕГ(Элемент.Значение), ВРЕГ(СтрокаПоиска))>0 Тогда
				Список.Добавить(Элемент.Значение);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого Строка Из Список Цикл
		Если ВСтрокеЕстьЦифры(Строка) Тогда
			Возврат Строка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

Функция ПолучитьКонецСтроки(Строка, Префикс)
	
	Позиция = Найти(ВРЕГ(Строка), ВРЕГ(Префикс));
	Если Позиция = 0 Тогда
		Возврат Префикс;
	Иначе
		Возврат Сред(Строка, Позиция);
	КонецЕсли;
	
КонецФункции

#КонецОбласти //ВспомогательныеПоискаПоКаталожномуНомеру

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыНоменклатураКодПриИзменении(Элемент)
	
	НайденныйЭлемент = НайтиНоменклатуруПоКоду(СокрЛП(Элемент.Значение));
	
	Если НайденныйЭлемент.ПометкаУдаления Тогда
		Сообщить("Элемент помечен на удаление!"+Символы.ПС+"Введите другой код");
		Возврат;
	КонецЕсли;
	
	Элементы.Товары.ТекущиеДанные.Номенклатура = НайденныйЭлемент;
	ПриИзмененииНоменклатурыТовары();
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕдиницаИзмеренияНоменклатуры(Номенклатура)
	
	Возврат Номенклатура.ЕдиницаИзмерения;
	
КонецФункции

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	ТекущиеДанные.ЕдиницаИзмерения = ЕдиницаИзмеренияНоменклатуры(ТекущиеДанные.Номенклатура);
	
КонецПроцедуры

Процедура ПриИзмененииНоменклатурыТовары()

	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;

	Если СтрокаТабличнойЧасти = Неопределено Тогда
		СтрокаТабличнойЧасти.ПереченьЗакупа = 0;
		Возврат;
	КонецЕсли;
	
	Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
	
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = Номенклатура.БазоваяЕдиницаИзмерения;
	
	Если ПустаяСтрока(СтрокаТабличнойЧасти.Артикул) Тогда
		СтрокаТабличнойЧасти.Артикул = ПолучитьКаталожныйНомер(Номенклатура);
	КонецЕсли;
	
КонецПроцедуры // ПриИзмененииНоменклатурыТовары()

#Область Артикул

&НаСервереБезКонтекста
Процедура ТоварыНоменклатураАртикулНачалоВыбораИзСпискаНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураАртикулНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	ТоварыНоменклатураАртикулНачалоВыбораИзСпискаНаСервере();
	Список = Новый СписокЗначений;
	Список.Добавить("Тест1");
	Список.Добавить("Тест2");
	Список.Добавить("Тест3");
	Элемент.СписокВыбора = Список;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТоварыНоменклатураАртикулНачалоВыбораНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураАртикулНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТоварыНоменклатураАртикулНачалоВыбораНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура АдресПоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти // Артикул

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыТовары
