
Процедура Данные()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкиСтроки.ИдСтроки,
	               |	ЗаявкиСтроки.НоменклатураСтрокой Номенклатура,
	               |	ЗаявкиСтроки.Контрагент,
	               |	ЗаявкиСтроки.Регистратор  Заявка
	               |ИЗ
	               |	РегистрСведений.ЗаявкиСтроки КАК ЗаявкиСтроки
	               |		LEFT OUTER JOIN РегистрСведений.ЗаявкиТендер КАК ЗаявкиТендер
	               |		ПО ЗаявкиСтроки.ИдСтроки = ЗаявкиТендер.ИдСтроки
	               |ГДЕ
	               |	ЗаявкиТендер.ИдСтроки IS NULL ";
				   
	Тбл = Запрос.Выполнить().Выгрузить();
	
	ЗначениеВРеквизитФормы(Тбл,"тбДанные");
				   
				   
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Данные();
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура тбДанныеВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	Мас = Новый Массив;
	Мас.Добавить(тбДанные[Значение].Номенклатура);
	Мас.Добавить(тбДанные[Значение].ИдСтроки);
	
	ОповеститьОВыборе(Мас);
КонецПроцедуры
