
Процедура Данные()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкаСтроки.ИдентификаторСтроки,
	               |	ЗаявкаСтроки.Номенклатура КАК Номенклатура,
	               |	ЗаявкаСтроки.Контрагент,
	               |	ЗаявкаСтроки.Регистратор КАК Заявка
	               |ИЗ
	               |	РегистрСведений.ЗаявкаСтроки КАК ЗаявкаСтроки
	               |		LEFT OUTER JOIN РегистрСведений.ЗаявкаТендер КАК ЗаявкаТендер
	               |		ПО ЗаявкаСтроки.ИдентификаторСтроки = ЗаявкиТендер.ИдентификаторСтроки
	               |ГДЕ
	               |	ЗаявкаТендер.ИдентификаторСтроки IS NULL ";
				   
	Тбл = Запрос.Выполнить().Выгрузить();
	
	ЗначениеВРеквизитФормы(Тбл,"тбДанные");
				   
				   
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Данные();
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура тбДанныеВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	Мас = Новый Массив;
	Мас.Добавить(тбДанные[Значение].Номенклатура);
	Мас.Добавить(тбДанные[Значение].ИдСтроки);
	
	ОповеститьОВыборе(Мас);
КонецПроцедуры
