
Функция УстановитьСтатус(ИдентификаторСтроки, Статус) Экспорт
	
	Пользователь = Пользователи.ТекущийПользователь();
	
	Если Не Справочники.СтатусыЗаявки.ПроверитьДоступСтатуса(Статус, Пользователь) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Запись = РегистрыСведений.ЗаявкаСтатусы.СоздатьМенеджерЗаписи();
	Запись.Период              = ТекущаяДата();
	Запись.ИдентификаторСтроки = ИдентификаторСтроки;
	Запись.Статус              = Статус;
	Запись.Ответственный       = Пользователь;
	Запись.ИмяКомпьютера       = ИмяКомпьютера();
	
	Запись.Записать();
	
	Возврат Истина;
	
КонецФункции

Процедура АвтоматическийСтатус(ИдентификаторСтроки, Перечень="") Экспорт
	
	Статус = ПолучитьСтатус(ИдентификаторСтроки);
	
	Если Статус.Пустая() Тогда
		УстановитьСтатус(ИдентификаторСтроки, Справочники.СтатусыЗаявки.СтатусНачало());
	КонецЕсли;
	
	Если ПустаяСтрока(Статус.Заголовок) И Не Статус.Следующий.Пустая() И Не Статус["Следующий"+Перечень].Пустая() Тогда
		УстановитьСтатус(ИдентификаторСтроки, Статус.Следующий);
	КонецЕсли;
	
КонецПроцедуры

Функция УстановитьСледующийСтатус(ИдентификаторСтроки, Перечень="") Экспорт
	
	Статус = ПолучитьСтатус(ИдентификаторСтроки);
	
	Если Статус = Справочники.СтатусыЗаявки.СтатусОтмена() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Перечень) Тогда
		Следующий = Статус["Следующий"+Перечень];
		Если Следующий.Пустая() Тогда
			Следующий = Статус.Следующий;
		КонецЕсли;
	Иначе
		Следующий = Статус.Следующий;
	КонецЕсли;
	
	Если Не Следующий.Пустая() Тогда
		УстановитьСтатус(ИдентификаторСтроки, Следующий);
	КонецЕсли;
	
КонецФункции

Функция УстановитьПредыдущийСтатус(ИдентификаторСтроки) Экспорт
	
	//Если ПолучитьСтатус(ИдентификаторСтроки) <> Справочники.СтатусыЗаявки.СтатусОтмена() Тогда
	//	Возврат Ложь;
	//КонецЕсли;
	
	ПредыдущийСтатус = РегистрыСведений.ЗаявкаСтатусы.ПолучитьПоследнее(ПолучитьДанные(ИдентификаторСтроки)[0].Период-1, Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки)).Статус;
	
	УстановитьСтатус(ИдентификаторСтроки, ПредыдущийСтатус);
	
КонецФункции

Функция ПолучитьДанные(ИдентификаторСтроки) Экспорт
	
	Отбор = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	
	Возврат РегистрыСведений.ЗаявкаСтатусы.СрезПоследних(, Отбор);
	
КонецФункции

Функция ПолучитьСтатус(ИдентификаторСтроки) Экспорт
	
	Отбор = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	
	Возврат РегистрыСведений.ЗаявкаСтатусы.ПолучитьПоследнее(, Отбор).Статус;
	
КонецФункции

Процедура ПоказатьДанныеСтатуса(Колонки, ОформлениеСтроки, Документ) Экспорт
	
	Если Колонки.ДатаСтатуса.Видимость
	 Или Колонки.СтатусЗаявки.Видимость
	 Или Колонки.ОтветственныйЗаСтатус.Видимость Тогда
	 
	 	Данные = ПолучитьДанные(Документ);
		
		Если Данные.Количество()=0 Тогда
			Возврат;
		Иначе
			ДатаСтатуса   = Данные[0].Период;
			СтатусЗаявки  = Данные[0].Статус;
			Ответственный = Данные[0].Ответственный;
			Оформление = СтатусЗаявки.Оформление.Получить();
			Если Оформление <> Неопределено Тогда 
				ЗаполнитьЗначенияСвойств(ОформлениеСтроки, Оформление);
			КонецЕсли;
		КонецЕсли;
		
		Если Колонки.ДатаСтатуса.Видимость Тогда
			ОформлениеСтроки.Ячейки.ДатаСтатуса.УстановитьТекст(ДатаСтатуса);
		КонецЕсли;
		
		Если Колонки.СтатусЗаявки.Видимость Тогда
			ОформлениеСтроки.Ячейки.СтатусЗаявки.УстановитьТекст(СтатусЗаявки);
		КонецЕсли;
		
		Если Колонки.ОтветственныйЗаСтатус.Видимость Тогда
			ОформлениеСтроки.Ячейки.ОтветственныйЗаСтатус.УстановитьТекст(Ответственный);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоказатьСтатусыЗаявки(Документ) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СтатусыЗаявок.Период КАК Дата,
	|	СтатусыЗаявок.Статус,
	|	СтатусыЗаявок.Ответственный
	|ИЗ
	|	РегистрСведений.СтатусыЗаявок КАК СтатусыЗаявок
	|ГДЕ
	|	СтатусыЗаявок.Документ = &Документ"
	);
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Запрос.Выполнить().Выгрузить().ВыбратьСтроку("Статусы заявки "+Документ.Номер+" от "+Документ.Дата);
	
КонецПроцедуры