
Функция УстановитьСтатус(Документ, Статус) Экспорт
	
	Пользователь = Пользователи.ТекущийПользователь();
	
	Если Не Справочники.СтатусыЗаявки.ПроверитьДоступСтатуса(Статус, Пользователь) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Запись = РегистрыСведений.ЗаявкаСтатусы.СоздатьМенеджерЗаписи();
	Запись.Период        = ТекущаяДата();
	Запись.ИдентификаторСтроки      = Документ;
	Запись.Статус        = Статус;
	Запись.Ответственный = Пользователь;
	Запись.ИмяКомпьютера = ИмяКомпьютера();
	
	Запись.Записать();
	
	Возврат Истина;
	
КонецФункции

Процедура АвтоматическийСтатус(Документ) Экспорт
	
	Статус = ПолучитьСтатус(Документ);
	
	Если Статус.Пустая() Тогда
		УстановитьСтатус(Документ, Справочники.СтатусыЗаявки.ПолучитьСтатусНачало());
	КонецЕсли;
	
	Если ПустаяСтрока(Статус.Заголовок) И Не Статус.Следующий.Пустая() Тогда
		УстановитьСтатус(Документ, Статус.Следующий);
	КонецЕсли;
	
КонецПроцедуры

Функция УстановитьПредыдущийСтатус(Документ) Экспорт
	
	Если ПолучитьСтатус(Документ) <> Справочники.СтатусыЗаявки.ПолучитьСтатусОтмена() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПредыдущийСтатус = РегистрыСведений.ЗаявкаСтатусы.ПолучитьПоследнее(ПолучитьДанные(Документ)[0].Период-1, Новый Структура("Документ", Документ)).Статус;
	
	УстановитьСтатус(Документ, ПредыдущийСтатус);
	
КонецФункции

Функция ПолучитьДанные(Документ) Экспорт
	
	Отбор = Новый Структура("Документ", Документ);
	
	Возврат РегистрыСведений.ЗаявкаСтатусы.СрезПоследних(, Отбор);
	
КонецФункции

Функция ПолучитьСтатус(Документ) Экспорт
	
	Отбор = Новый Структура("Документ", Документ);
	
	Возврат РегистрыСведений.ЗаявкаСтатусы.ПолучитьПоследнее(, Отбор).Статус;
	
КонецФункции

Процедура ПоказатьДанныеСтатуса(Колонки, ОформлениеСтроки, Документ) Экспорт
	
	Если Колонки.ДатаСтатуса.Видимость
	 Или Колонки.СтатусЗаявки.Видимость
	 Или Колонки.ОтветственныйЗаСтатус.Видимость Тогда
	 
	 	Данные = ПолучитьДанные(Документ);
		
		Если Данные.Количество()=0 Тогда
			Возврат;
		Иначе
			ДатаСтатуса   = Данные[0].Период;
			СтатусЗаявки  = Данные[0].Статус;
			Ответственный = Данные[0].Ответственный;
			Оформление = СтатусЗаявки.Оформление.Получить();
			Если Оформление <> Неопределено Тогда 
				ЗаполнитьЗначенияСвойств(ОформлениеСтроки, Оформление);
			КонецЕсли;
		КонецЕсли;
		
		Если Колонки.ДатаСтатуса.Видимость Тогда
			ОформлениеСтроки.Ячейки.ДатаСтатуса.УстановитьТекст(ДатаСтатуса);
		КонецЕсли;
		
		Если Колонки.СтатусЗаявки.Видимость Тогда
			ОформлениеСтроки.Ячейки.СтатусЗаявки.УстановитьТекст(СтатусЗаявки);
		КонецЕсли;
		
		Если Колонки.ОтветственныйЗаСтатус.Видимость Тогда
			ОформлениеСтроки.Ячейки.ОтветственныйЗаСтатус.УстановитьТекст(Ответственный);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоказатьСтатусыЗаявки(Документ) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СтатусыЗаявок.Период КАК Дата,
	|	СтатусыЗаявок.Статус,
	|	СтатусыЗаявок.УдалитьСтатус,
	|	СтатусыЗаявок.Ответственный
	|ИЗ
	|	РегистрСведений.СтатусыЗаявок КАК СтатусыЗаявок
	|ГДЕ
	|	СтатусыЗаявок.Документ = &Документ"
	);
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Запрос.Выполнить().Выгрузить().ВыбратьСтроку("Статусы заявки "+Документ.Номер+" от "+Документ.Дата);
	
КонецПроцедуры