
&НаКлиенте
Процедура ПриВыбореКвартала(НомКв=Неопределено)
	
	Если НомКв = Неопределено Тогда
		НомКв = ЦЕЛ(Месяц(ДатаПериода)/3)+1;	
	Конецесли;

	ДЛя а=1 по 4 Цикл
		Если а=НомКв Тогда
			Элементы["ВыборКвартала"+а].ЦветФона = WebЦвета.НавахоБелый;
		ИНАче
			Элементы["ВыборКвартала"+а].ЦветФона = Новый Цвет;
		КонецЕСЛИ;
	КонецЦикла;
	
	Элементы.Список.Период.ДатаНачала = ДатаПериода;
	Элементы.Список.Период.ДатаОкончания = ДатаПериода;
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКвартала(Команда)
	
	п = Число(прав(этаформа.ТекущийЭлемент.Имя,1))-1;
	ДатаПериода = ДобавитьМесяц(НачалоГода(ДатаПериода),п*3);
	ПриВыбореКвартала();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПериодаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДатаПериода = ДобавитьМесяц(ДатаПериода, 12*Направление);
	ПриВыбореКвартала();
	
КонецПроцедуры

&НаСервере
Функция СинхронизироватьНаСервере()
	Возврат РегистрыСведений.ЗаявкаПереченьОферт.ЗагрузитьДанныеОферт(ДатаПериода);
КонецФункции

&НаКлиенте
Процедура Синхронизировать(Команда)
	
	Ошибки = СинхронизироватьНаСервере();
	
	Если ПустаяСтрока(Ошибки) Тогда
		Элементы.Список.Обновить();
		ПоказатьПредупреждение(, "Выполнено", 2);
	Иначе	
		ПоказатьПредупреждение(, Ошибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаПериода = НачалоКвартала(ТекущаяДата());
	ПриВыбореКвартала();
КонецПроцедуры
