
&НаСервере
Процедура ЗаполнитьПоУмолчаниюНаСервере()
	
	Объект.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ЗаполнитьПоУмолчаниюНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщийСписокРеквизитов.Очистить();
	
	Форма = ПолучитьФорму("Документ.ЗаявкаОтПокупателя.ФормаОбъекта");
	Для Каждого Колонка Из Форма.ЭлементыФормы.Товары.Колонки Цикл
		
		ПараметрыРеквизита = Новый Структура("Имя, Видимость, Доступность", Колонка.Имя, Колонка.Видимость, ?(Колонка.ЭлементУправления=Неопределено, Колонка.Доступность, Колонка.ЭлементУправления.ТолькоПросмотр));
		
		ОбщийСписокРеквизитов.Добавить(ПараметрыРеквизита, Колонка.Имя);
		
	КонецЦикла;
	
	УстановитьОформление();
	
КонецПроцедуры

&НаСервере
Процедура КомандаИнвертироватьФлагиНаСервере()
	
	Для Каждого Реквизит Из Объект.Реквизиты Цикл
		Реквизит.Видимость = Не Реквизит.Видимость;
		Реквизит.Доступность = Не Реквизит.Доступность;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИнвертироватьФлаги(Команда)
	
	КомандаИнвертироватьФлагиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Оформление = ТекущийОбъект.Оформление.Получить();
	
	Если ТипЗнч(Оформление) <> Тип("Структура") Тогда
		Оформление = Новый Структура;
		Оформление.Вставить("Шрифт"     , Новый Шрифт);
		Оформление.Вставить("ЦветФона"  , Новый Цвет);
		Оформление.Вставить("ЦветТекста", Новый Цвет);
	КонецЕсли;
	
	Шрифт      = Оформление.Шрифт;
	ЦветФона   = Оформление.ЦветФона;
	ЦветТекста = Оформление.ЦветТекста;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Оформление = Новый Структура;
	Оформление.Вставить("Шрифт"     , Шрифт     );
	Оформление.Вставить("ЦветФона"  , ЦветФона  );
	Оформление.Вставить("ЦветТекста", ЦветТекста);
	
	ТекущийОбъект.Оформление = Новый ХранилищеЗначения(Оформление);
	
КонецПроцедуры

&НаКлиенте
Процедура ОформлениеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЭтаФорма[Элемент.Имя] = ?(Лев(Элемент.Имя, 4) = "Цвет", Новый Цвет, Новый Шрифт);
	
КонецПроцедуры

&НаСервере
Функция СписокОставшихсяРеквизитов()
	
	ПараметрыНаФорме = Объект.Реквизиты.Выгрузить(, "Имя").ВыгрузитьКолонку("Имя");
	
	Список = Новый СписокЗначений;
	
	Для Каждого ЭлементСписка Из ОбщийСписокРеквизитов Цикл
		Если ПараметрыНаФорме.Найти(ЭлементСписка.Значение.Имя) = Неопределено Тогда
			Список.Добавить(ЭлементСписка.Значение.Имя, ЭлементСписка.Значение.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

&НаКлиенте
Процедура КомандаЗаполнитьВсеРеквизиты(Команда)
	
	Для Каждого Элемент Из СписокОставшихсяРеквизитов() Цикл
		ЗаполнитьЗначенияСвойств(Объект.Реквизиты.Добавить(), Элемент.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыИмяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Элементы.РеквизитыИмя.СписокВыбора.Очистить();
	Для Каждого Элемент Из СписокОставшихсяРеквизитов() Цикл
		Элементы.РеквизитыИмя.СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыИмяАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Элементы.РеквизитыИмя.СписокВыбора.Очистить();
	Для Каждого Элемент Из СписокОставшихсяРеквизитов() Цикл
		Элементы.РеквизитыИмя.СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыИмяОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Для Каждого ЭлементСписка Из ОбщийСписокРеквизитов Цикл
		Если ЭлементСписка.Значение.Имя = ВыбранноеЗначение Тогда
			ЗаполнитьЗначенияСвойств(Элементы.Реквизиты.ТекущиеДанные, ЭлементСписка.Значение);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОформление()
	
	Элементы.Наименование.Шрифт      = Шрифт;
	Элементы.Наименование.ЦветФона   = ЦветФона;
	Элементы.Наименование.ЦветТекста = ЦветТекста;
	
КонецПроцедуры

&НаКлиенте
Процедура ОформлениеПриИзменении(Элемент)
	
	УстановитьОформление();
	
КонецПроцедуры
