
&НаСервере
Функция ПолучитьЕмайл()
	
	ПочтаПользователя = "";
	
	ИзмеренияРегистра = Новый Структура;
	ИзмеренияРегистра.Вставить("Объект", Пользователь);
	ИзмеренияРегистра.Вставить("Тип"   , Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ИзмеренияРегистра.Вставить("Вид"   , Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя);
	
	ЗначенияРесурсов = РегистрыСведений.КонтактнаяИнформация.Получить(ИзмеренияРегистра);
	
	Если ЗначенияРесурсов <> Неопределено Тогда
		ПочтаПользователя = ЗначенияРесурсов.Представление;
	КонецЕсли;
	
	Возврат ПочтаПользователя;
	
КонецФункции

&НаСервере
Функция ПолучитьПароль()
	
	Возврат РегистрыСведений.БезопасноеХранилищеДанных.ПолучитьПарольПочта();
	
КонецФункции

&НаСервере
Процедура ЗаписатьЕмайл(Емайл)
	
	Если ПустаяСтрока(Емайл) Тогда
		Возврат;
	КонецЕсли;
	
	Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Запись.Объект = Пользователь;
	Запись.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	Запись.Вид = Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя;
	Запись.Представление = СокрЛП(Емайл);
	Запись.Записать();
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьПароль(Пароль)
	
	Возврат РегистрыСведений.БезопасноеХранилищеДанных.ЗаписатьПарольПочта(Пароль);
	
КонецФункции

&НаКлиенте
Процедура УстановитьДоступность(Текст=Неопределено)
	
	Если Текст = Неопределено Тогда
		Текст = Емайл;
	КонецЕсли;
	
	Поз1 = Найти(Текст, "@");
	Поз2 = Найти(Сред(Текст, Поз1+1), ".");
	
	ФлагДоступность = 1 < Поз1 И 1 < Поз2 И Поз2 < СтрДлина(Сред(Текст, Поз1+1));
	
	Элементы.ФормаКомандаСохранить.Доступность = ФлагДоступность;
	Элементы.ФормаКомандаОтправить.Доступность = ФлагДоступность;
	
	Если Элементы.ФормаКомандаОтправить.Картинка <> БиблиотекаКартинок.Отправить Тогда
		Емайл = Текст;
		Элементы.ФормаКомандаОтправить.Картинка = БиблиотекаКартинок.Отправить;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранить(Команда)
	
	ЗаписатьЕмайл(Емайл);
	ЗаписатьПароль(Пароль);
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтправить(Команда)
	
	Результат = Документы.ЗаявкаОтПокупателя.ОтправитьПисьмо(Емайл, Емайл, "Тестовое сообщение", "Если Вы читаете это сообщение, значит тест отправки сообщения прошел успешно.");
	Если ТипЗнч(Результат) = Тип("Булево") И Результат Тогда
		Элементы.ФормаКомандаОтправить.Картинка = БиблиотекаКартинок.СформироватьПодтверждения;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕмайлИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	УстановитьДоступность(Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Емайл  = ПолучитьЕмайл();
	Пароль = ПолучитьПароль();
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Если СокрЛП(Емайл) <> ПолучитьЕмайл() Тогда 
		ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьПередЗакрытием", ЭтаФорма), "Электронная почта изменена. Сохранить изменения?", РежимДиалогаВопрос.ДаНет);
	ИначеЕсли СокрЛП(Пароль) <> ПолучитьПароль() Тогда 
		ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьПередЗакрытием", ЭтаФорма), "Пароль элекронной почты изменен. Сохранить изменения?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПередЗакрытием(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаписатьЕмайл(Емайл);
		ЗаписатьПароль(Пароль);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Заголовок = "E·mail "+Пользователь;
	
КонецПроцедуры
