
&НаСервере
Функция ПолучитьСписок(Документ)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СтатусыЗаявок.Период КАК Дата,
	|	СтатусыЗаявок.Статус,
	|	СтатусыЗаявок.Ответственный
	|ИЗ
	|	РегистрСведений.СтатусыЗаявок КАК СтатусыЗаявок
	|ГДЕ
	|	СтатусыЗаявок.Документ = &Документ"
	);
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("РегистрСведений.СтатусыЗаявок.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	ПолучитьСписок(ПараметрКоманды).ВыбратьСтроку(); //"Статусы заявки "+ПараметрКоманды.Номер+" от "+ПараметрКоманды.Дата);
	
КонецПроцедуры
