&НаКлиенте
Процедура ОткрытьСайт() Экспорт
	
	ЗапуститьПриложение("https://app.powerbi.com/view?r=eyJrIjoiZTA1YmYyMzEtN2UzMi00MTQ5LTkzN2EtY2VjMTE3OTJmOGQ0IiwidCI6IjZmNmI0YzZmLTRlMjAtNDFmMS1hZWNlLTNjMjQzMzcwMzI4ZSIsImMiOjl9");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСоединение() Экспорт
	
	Соединение = Новый ComObject("ADODB.Connection");
	Соединение.CommandTimeout = 600;
	Соединение.ConnectionTimeout = 30;
	СтрСоединения = "Driver={SQL Server};Server=tcp:urals.database.windows.net,1433;Initial Catalog=SVOD;Persist Security Info=False;User ID=max;Password=1!qqqqqq;MultipleActiveResultSets=False;Encrypt=True;TrustServerCertificate=False;Connection Timeout=30;";
	Попытка
		Соединение.Open(СтрСоединения);
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Соединение;
	
КонецФункции

&НаСервере
Функция ПолучитьОстатокЕдиногоСклада(Знач СтрокаПоиска="", Таблицей=Ложь, ОстатокЕдиногоСкладаПоСтроке=Неопределено)
	
	Таблица = Новый ТаблицаЗначений;
	
	Если ПустаяСтрока(СтрокаПоиска) Тогда
		Возврат ?(Таблицей, Таблица, 0);
	КонецЕсли;
	
	СтрокаПоиска = СокрЛП(СтрокаПоиска);
	
	Если ОстатокЕдиногоСкладаПоСтроке = Неопределено Тогда
		ОстатокЕдиногоСкладаПоСтроке = Новый Соответствие;
	ИначеЕсли Не Таблицей Тогда
		Остаток = ОстатокЕдиногоСкладаПоСтроке.Получить(СтрокаПоиска);
		Если Остаток <> Неопределено Тогда
			Возврат Остаток;
		КонецЕсли;
	КонецЕсли;
	
	//Если СоединениеСЕдинымСкладом = Неопределено Тогда
		СоединениеСЕдинымСкладом = ПолучитьСоединение();
		Если СоединениеСЕдинымСкладом = Неопределено Тогда
			Сообщить("Нет подключения к сайту единого склада!");
			Возврат ?(Таблицей, Таблица, 0);
		КонецЕсли;
	//КонецЕсли;
	
	// innOrg, nameOrg, idNom, Nom, code, ed, dt, warehouse, yr, Kol, price, Sum, dtSynchro
	ПредставлениеПолей = Новый Соответствие;
	ПредставлениеПолей.Вставить("code"     , "Код Юралс"   );
	ПредставлениеПолей.Вставить("Nom"      , "Наименование");
	ПредставлениеПолей.Вставить("nameOrg"  , "Организация" );
	ПредставлениеПолей.Вставить("warehouse", "Склад"       );
	ПредставлениеПолей.Вставить("Kol"      , "Количество"  );
	ПредставлениеПолей.Вставить("price"    , "Цена"        );
	ПредставлениеПолей.Вставить("dt"       , "Дата"        );
	
	ШиринаПолей = Новый Соответствие;
	ШиринаПолей.Вставить("code"     , 13);
	ШиринаПолей.Вставить("Nom"      , 53);
	ШиринаПолей.Вставить("Kol"      , 13);
	ШиринаПолей.Вставить("price"    , 13);
	ШиринаПолей.Вставить("dt"       , 13);
	
	ФорматПолей = Новый Соответствие;
	ФорматПолей.Вставить("Kol"      , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	ФорматПолей.Вставить("price"    , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ФорматПолей.Вставить("dt"       , Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	
	Попытка
		НаборЗаписей = Новый COMObject("ADODB.Recordset");
		НаборЗаписей.Open(
		"SELECT
		|	code,
		|	Nom,
		|	Kol,
		|	price,
		|	dt,
		|	nameOrg,
		|	warehouse
		|FROM
		|	productBalance21
		|WHERE
		|	Code = '"+СтрокаПоиска+"' OR UPPER(Nom) LIKE UPPER(N'%"+СтрЗаменить(СтрокаПоиска, " ", "%")+"%')
		|ORDER BY
		|	Nom"
		, СоединениеСЕдинымСкладом);
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат "Ошибка получения данных";
	КонецПопытки;
	
	Для х=0 По НаборЗаписей.Fields.Count-1 Цикл
		Имя = НаборЗаписей.Fields(х).Name;
		Таблица.Колонки.Добавить(Имя, ФорматПолей.Получить(Имя), ПредставлениеПолей.Получить(Имя), ШиринаПолей.Получить(Имя));
	КонецЦикла;
	
	Пока Не НаборЗаписей.EOF() Цикл
		СтрокаТаблицы = Таблица.Добавить();
		Для х=0 По НаборЗаписей.Fields.Count-1 Цикл
			СтрокаТаблицы[НаборЗаписей.Fields(х).Name] = НаборЗаписей.Fields(х).Value;
		КонецЦикла;
		НаборЗаписей.MoveNext();
	КонецЦикла;
	
	НаборЗаписей.Close();
	
	Если Таблицей Тогда
		Возврат Таблица;
	КонецЕсли;
	
	Остаток = Таблица.Итог("Kol");
	
	ОстатокЕдиногоСкладаПоСтроке.Вставить(СтрокаПоиска, Остаток);
	
	Возврат Остаток;
	
КонецФункции

