
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Вставить содержимое обработчика     
	Запись.ЛогОтвет = СокрЛП(ТекущаяДата())+" "+ИмяПользователя()+" "+ИмяКомпьютера();
КонецПроцедуры

&НаСервере
Функция ПолучитьНоменклатуруНаСервере(идСтроки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкиСтроки.Номенклатура,
	               |	ЗаявкиСтроки.НоменклатураСтрокой
	               |ИЗ
	               |	РегистрСведений.ЗаявкиСтроки КАК ЗаявкиСтроки
	               |ГДЕ
	               |	ЗаявкиСтроки.ИдСтроки = &ИдСтроки";
				   Запрос.УстановитьПараметр("идСтроки",идСтроки);
				   ТБл = Запрос.Выполнить().Выгрузить();
				   Если Тбл.Количество()>0 Тогда
					   Возврат ТБл[0].НоменклатураСтрокой;
				   ИНаче
					   Возврат "";
					  КонецЕСЛИ;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьНоменклатуру()
	рез="";
	Если ЗначениеЗаполнено(Запись.ИдСтроки) ТОгда
		Рез = ПолучитьНоменклатуруНаСервере(Запись.идСтроки);
	КонецеСЛИ;
	ЭтаФорма.Номенклатура = рез;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если СокрЛП(Запись.Емайл) <> ""
		или Найти(Запись.ЛогОтвет,ПараметрыСеанса.ТекущийПользователь)=0 Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
		ЭтаФорма.Элементы.Номенклатура.ТолькоПросмотр = Истина;
	КонецЕСЛИ;
	
	 РегистрыСведений.ЗаявкиОтвет.ПолучитьСписокУсловийОплат(Элементы.УсловияОплаты.СписокВыбора);
	 
	ПолучитьНоменклатуру();
КонецПроцедуры


&НаКлиенте
Процедура НоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложЬ;
	
	Фрм = ПолучитьФорму("РегистрСведений.ЗаявкиОтвет.Форма.Форма");
	фрм.ЗакрыватьПривыборе= Истина;
	Рез = Фрм.ОткрытьМодально();
	Если Рез<>Неопределено ТОгда
		Запись.ИдСтроки = Рез[1];
		ЭтаФорма.Номенклатура = Рез[0];
	КонецЕСЛИ;
	
КонецПроцедуры


&НаКлиенте
Процедура ОтказПриИзменении(Элемент)
	Запись.Цена = 0;
КонецПроцедуры



