
&НаСервереБезКонтекста
Функция НужноИнициализировать()
	
	Возврат Не Справочники.СтатусыЗаявки.ЕстьЭтапыЗаявки();
	
КонецФункции

&НаСервереБезКонтекста
Функция Инициализировать()
	
	Возврат Справочники.СтатусыЗаявки.ИнициализироватьБазовыеЭтапы();
	
КонецФункции

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НужноИнициализировать() Тогда
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПродолжитьСписокПередНачаломДобавления", ЭтотОбъект), "Инициализировать базовые этапы?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&Наклиенте
Процедура ПродолжитьСписокПередНачаломДобавления(Знач Результат, Знач ПараметрКоманды) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если Инициализировать() Тогда
		Элементы.Список.Обновить();
		ПоказатьПредупреждение(, "Базовые этапы созданы");
	КонецЕсли;
	
КонецПроцедуры