
&НаСервере
Функция ЗагрузитьДанные(НаДатуКвартала=Неопределено) Экспорт
	
	КодРегиона = "NV";
	НачКвартала = ?(НаДатуКвартала=Неопределено, НачалоКвартала(ТекущаяДата()), НаДатуКвартала);
	
	Данные = ОбменAPI.ПолучитьДанныеAPI("/ServiceMP/hs/ksAPI/", "allorg");
	Если ТипЗнч(Данные) = Тип("Массив") Тогда
		НайденнаяСтрока = Данные[1].Найти(Справочники.Организации.ОрганизацияПоУмолчанию().ИНН, "Код");
		Если НайденнаяСтрока <> Неопределено Тогда
			КодРегиона = НайденнаяСтрока.КодРегиона;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Данные) = Тип("Строка") Тогда 
		Возврат Данные;
	КонецЕсли;
	
	Данные = ОбменAPI.ПолучитьДанныеAPI(, "OFFERS", Новый Структура("Дт, КодРегиона", НачКвартала, КодРегиона));
	
	Если ТипЗнч(Данные) = Тип("Строка") Тогда 
		Возврат Данные;
	КонецЕсли;
	
	Данные.Колонки.Добавить("Период");
	Данные.ЗаполнитьЗначения(НачКвартала, "Период");
	
	НаборЗаписей = РегистрыСведений.ЗаявкаПереченьОферт.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(НачКвартала);
	НаборЗаписей.Прочитать();
	
	НаборЗаписей.Загрузить(Данные);
	НаборЗаписей.Записать();
		
	Возврат "";
	
КонецФункции

&НаСервере
Функция ЕстьНоменклатураВПериоде(Номенклатура=Неопределено, Период = Неопределено) Экспорт
	
	НаДату = НачалоКвартала(?(Период=Неопределено, ТекущаяДата(), Период));
	
	Если Номенклатура = Неопределено Тогда
		Выборка = РегистрыСведений.ЗаявкиПереченьОферт.Выбрать(НаДату, НаДату);
	Иначе
		Выборка = РегистрыСведений.ЗаявкиПереченьОферт.Выбрать(НаДату, НаДату, Новый Структура("Номенклатура", Номенклатура));
	КонецЕсли;
	
	Возврат Выборка.Следующий();
	
КонецФункции
